
Internet Draft                                              Dae-Gun Kim
                                                                 KT and 
Document: draft-kim-ccamp-gmpls-mgoxc-00.txt           Korea University
Expiration Date: December 2003                           Gyu Myoung Lee
                                                          Jun Kyun Choi
                                                                    ICU
                                                          SungChang Lee
  
                                                        Hankuk Aviation 
                                                             University
                                                           Jin Woo Park
                                                          Chul-Hee Kang
                                                       Korea University
  
                                                              June 2003
  
                                      
   GMPLS Extensions to support Multi-Granularity Optical Cross-Connect 
                  with Heterogeneous Optical Interfaces 
                                     
                    draft-kim-ccamp-gmpls-mgoxc-00.txt 
   
 Status of this Memo 
   
    This document is an Internet-Draft and is in full conformance with 
    all provisions of Section 10 of [RFC2026].  
     
    The list of current Internet-Drafts can be accessed at 
    http://www.ietf.org/ietf/1id-abstracts.txt  
   
    The list of Internet-Draft Shadow Directories can be accessed at 
    http://www.ietf.org/shadow.html. 
   
   
 Abstract 
   
  This document defines information needed when GMPLS signaling is used 
  on the multi-granularity of optical cross-connect (MG-OXC) over 
  Generalized Multiprotocol Label Switching (GMPLS) networks because 
  existing documents deal only with singular wavelength OXC. The basic 
  optical label handlings (including add, drop, swap, merge, and stack) 
  are required for using the MG-OXC in GMPLS networks. Also the 
  protocol related to signaling is extended for supporting the MG-OXC. 
   
   
   
   
   
   
 
Kim et al               Expires - December 2003                [Page  1]
                                 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
 Conventions 
   
    The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
    "SHOULD", "SHOULD NOT", "RECOMMENDED",  "MAY", and "OPTIONAL" in 
    this document are to be interpreted as described in [RFC2119]. 
   
   
 Table of Contents 
 
   1. Introduction....................................................2 
     1.1. Terminology and Definitions.................................3 
   2. The Architecture of Multi-granularity Optical Cross-Connect.....4 
     2.1. MG-OXC Node Architecture....................................4 
     2.2. Network Hierarchy in MG-OXC Networks........................6 
   3. Label Handlings in MG-OXC based GMPLS networks..................7 
   4. Signaling extensions for MG-OXC networks........................8 
     4.1. MG-OXC Parameters...........................................8 
     4.2. RSVP-TE Details............................................10 
     4.3. CR-LDP Details.............................................11 
   5. Operation and Management Considerations........................11 
   6. Security Considerations........................................12 
   References........................................................12 
   Author's Addresses................................................13 
   
   
1. Introduction  
    
   According to the recent rapid increasing of IP traffic, Wavelength 
   Division Multiplexing (WDM) technology is becoming a technology-of-
   choice to meet the tremendous bandwidth demand of IP traffic. WDM 
   networks using wavelength routing by optical cross-connect(OXC) have 
   emerged  as  the  most  feasible  architecture  solution  for  next 
   generation  optical  networks.  OXC  facilitate  the  switching  of 
   individual wavelengths at the nodes of a WDM-based network. However, 
   increase in the number of wavelength channels results in increased 
   complexity of OXCs and increased difficulty in implementing and 
   maintaining OXCs.  
    
   The concept of multi-granularity OXC (MG-OXC) has been recently 
   introduced as a means to reduce OXC complexity [WAVEBAND][HCROSS]. 
   MG-OXC can not only switch traffic at multiple granularities such as 
   fiber, waveband, wavelength, but also add and drop traffic at 
   multiple granularities. Note that multi-granularity of MG-OXC means 
   the multiple granularities of optical interfaces in MG-OXC and does 
   not mean the granularity of bandwidth in network resources. The 
   waveband is formed by grouping several wavelengths and is routed as a 
   single channel. Also the fiber channel is formed by grouping several 
   wavebands and is routed as a single channel.  
    
 
 
Kim et al              Expires - December 2003                 [Page  2]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   This document defines information needed when GMPLS signaling is used 
   on the MG-OXC over Generalized Multiprotocol Label Switching (GMPLS) 
   networks  because  existing  documents  deal  only  with  singular 
   wavelength OXC. The basic optical label operations (including add, 
   drop, swap, and stack) are performed by using the MG-OXC at nodes in 
   GMPLS networks. And new recovery mechanism for MG-OXC is provided 
   because existing recovery approaches deal only with failures of OXCs 
   with only individual wavelengths and fiber/link failure. The protocol 
   related to signaling is extended for the multi-granularity optical 
   cross-connect. 
    
   A main goal of this work is to provide interoperable functionality in 
   multi-vendor service provider networks. To maintain consistency in 
   the provision of end-to-end service in a multi-provider environment, 
   rules governing the operations of recovery mechanisms at domain 
   boundaries must also be specified. 
    
    
1.1. Terminology and Definitions 
 
   The reader is assumed to be familiar with the GMPLS terminology as 
   defined in [GMPLS-ARCH]. The following abbreviations are used in this 
   document: 
    
   - OXC (Optical Cross-Connect) 
   - MG-OXC (Multi-Granularity OXC)  
    Several wavelengths are grouped together as a waveband and switched 
    as a single port whenever possible. A waveband is demultiplexed 
    into individual wavelengths if and only if necessary when the 
    waveband carries at least one lightpath that needs to be dropped or 
    added. Multi-granularity OXCs not only switch traffic at multiple 
    layers such as wavelength, waveband, and fiber, but also add and 
    drop traffic at multiple granularities. 
    
   - WXC (Wavelength Cross-Connect) 
     This is to switch lightpaths by wavelength unit. 
    
   - BXC (Waveband Cross-Connect) 
     This is to switch lightpaths by waveband unit. The waveband is 
     formed by grouping several wavelengths and is routed as a single 
     channel.  
    
   - FXC (Fiber Cross-Connect)  
     This is to switch lightpaths by fiber unit.  The fiber channel is 
     formed by grouping several wavebands and is routed as a single 
     channel.  
    
     Note) MG-OXC is composed of WXC, BXC and FXC (see Figure 1). 
     
   - Optical LSP (Label Switched Path) 
     This include the W-LSP, B-LSP, F-LSP 
    
 
 
Kim et al              Expires - December 2003                 [Page  3] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   - W-LSP (Wavelength Label Switched Path) 
   - B-LSP (Waveband Label Switched Path) 
   - LSP (Fiber Label Switched Path) 
    
   - Network Hierarchy 
     This is an abstraction of a part of a network∆s topology, routing 
     and signaling mechanisms. Abstraction may be used as a mechanism 
     to  build  large  networks  or  as  a  technique  for  enforcing 
     administrative, topological, or geographic boundaries. For example, 
     network hierarchy might be used separate the regional and backbone 
     sections  of  a  network,  or  to  interconnect  service  provider 
     networks (with BGP which reduces a network to an Autonomous 
     System). 
     
   - Vertical Hierarchy 
     This is oriented between two network technology layers. 
    
   - Horizontal Hierarchy 
     This is oriented between two areas or administrative subdivisions 
     within the same network technology layer. 
     
    
2. The Architecture of Multi-granularity Optical Cross-Connect 
 
2.1. MG-OXC Node Architecture 
 
   In  GMPLS  networks,  an  OXC  consists  of  three  major  parts: 
   demultiplexer, optical switch matrix, and multiplexer. OXC complexity 
   can be characterized by the size of optical switch matrix. Note that 
   intermediate traffic dominates over end-to-end traffic in GMPLS 
   networks. Since many lightpath conveying intermediate might have the 
   same route, the size of the optical switch matrix would be largely 
   reduced if they were dealt with as a single channel or port. In 
   single granularity OXCs, OXC switches traffic only at the wavelength 
   layer and wavelengths either terminate at or transparently pass 
   through a node, each requiring a port. However, in multi-granularity 
   OXCs several wavelengths are grouped together as a waveband and 
   switched  as  a  single  port  whenever  possible.  A  waveband  is 
   demultiplexed into individual wavelengths if and only if necessary 
   when the waveband carries at least one lightpath that needs to be 
   dropped or added. Multi-granularity OXCs not only switch traffic at 
   multiple layers such as wavelength, waveband, and fiber, but also add 
   and  drop  traffic  at  multiple  granularities.  Traffic  can  be 
   transported  from  one  layer  to  another  via  multiplexers  and 
   demultiplexers within the MG-OXC. 
   The architecture of multilayer MG-OXC node is shown in Figure 1, 
   which includes the wavelength cross-connect (WXC), waveband cross-
   connect (BXC), and fiber cross-connect (FXC) layers. As shown in 
   Figure 1, the WXC and BXC layers consists of cross-connects and 
   multiplexers/demultiplexers. The WXC layer includes a WXC that is 
   used to switch lightpaths. To add/drop wavelengths from the WXC layer, 
   we  need  wavelength  add/drop  ports.  In  addition,  waveband  to 
 
 
Kim et al              Expires - December 2003                 [Page  4]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   wavelength  demultiplxers  are  used  to  demultiplex  wavebands  to 
   wavelengths, and wavelength to waveband multiplexers are used to 
   multiplex wavelengths to wavebands. At the BXC layer, the waveband 
   cross-connect, waveband add/drop ports are used for bypass and 
   add/drop wavebands. Fiber to waveband demultiplexers are used to 
   demultiplex fibers to wavebands. Waveband to fiber multiplexers are 
   used to multiplex wavebands to form fibers. Similarly, fiber cross-
   connect and fiber add/drop ports are used to switch and add/drop 
   fibers at FXC layer. In order to reduce the number of ports, the MG-
   OXC switches a fiber using one port at the fiber cross-connect if 
   none of its wavelength is used to add to drop a lightpath. Otherwise, 
   it will demultiplex the fiber into wavebands, and switch an entire 
   wavebands using one port at the waveband cross-connect if none of its 
   wavelength is used to add to drop a lightpath. In other words, only 
   the wavebands whose wavelengths are needed to be added or dropped 
   will be demultiplexed, and only the wavelengths in those wavebands 
   that carry bypass traffic needed to be switched using the WXC. With 
   this architecture, it is possible to dynamically select fibers for 
   multiplexing/demultilexing  from  the  FXC  to  the  BXC  layer,  and 
   wavebands for multiplexing/demultiplexing from the BXC to the WXC 
   layer. 
    
                
                    add/drop +---+ 
                     <-------|   |--------> 
                    +----+   |   |    +----+ 
               +--->|DMUX|---|WXC|----|MUX |----+  
               |    +----+   |   |    +----+    |  
               |             |   |              |  
               |             +---+              |  
               |                                |   
               |             +---+              |    
               +-------------|   |<-------------+   
                    +----+   |   |    +-----+      
               +----|MUX |---|BXC|----|DMUX |<--+   
               |    +----+   |   |    +-----+   |  
               |     <-------|   |-------->     |  
               |    add/drop +---+              |  
               |                                |  
               |             +---+              |  
               +------------>|   |--------------+  
                             |FXC|                 
                    <--------|   |--------> 
                   add/drop  +---+ 
    
    
   [FIGURE 1] The Node Architecture of of three layer Multi-Granularity 
                      Optical Cross-connect (MG-OXC) 
     
   GMPLS in conjunction with MG-OXCs can be bring about tremendous 
   benefits in terms of reducing the number of ports of OXCs, which in 
   turn  reduces  the  size  of  the  OEO  (optical-electrical-optical) 
 
 
Kim et al              Expires - December 2003                 [Page  5]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   grooming switch, as well as the cost and difficulty associated with 
   controlling them. In addition to reducing the port count, the use of 
   wavebands reduces the number of entities that have to be managed in 
   the system, and enables hierarchical and independent management of 
   the  information  relevant  to  fibers,  wavebands  and  wavelengths. 
   Moreover, relatively small-scale modular switching matrices are now 
   sufficient to construct large-capacity optical cross-connects, making 
   the system more scalable. Finally all of these also result in reduced 
   complexity  of  controlling  the  switch  matrix,  provisioning,  and 
   providing recovery. 
    
2.2. Network Hierarchy in MG-OXC Networks 
 
   In MG-OXC networks, the network hierarchy is established by dividing 
   wavelength  layer,  waveband  layer,  and  fiber  layer.  Vertical 
   hierarchical network is between each optical layer and Horizontal 
   hierarchical network is between two areas within the same optical 
   layer [RFC3386]. 
    
   This hierarchical LSP is created by using the label-stacking and 
   label-merging  (see  section3)  that  allow  designated  MG-OXCs  to 
   exchange information with one another and act as border MG-OXCs to a 
   large area of GMPLS networks and other MG-OXCs. The aggregation of 
   optical LSP is carried out by stacking the labels of smaller optical 
   LSPs. The larger optical LSP traverses through the GMPLS networks. 
   For example, optical LSP has following relations: F-LSP > B-LSP > W-
   LSP. At the end of the larger optical LSP, the smaller optical LSPs 
   are separated by label destacking.  
    
   In the case of functional description needed to support GMPLS-based 
   recovery in MG-OXC networks, Protocol specific formats and mechanisms 
   will be described in companion documents. 
    
   Due to possible failures of the ports and multiplexers/demultiplexers 
   within a MG-OXC, as well as possible failure of waveband converters, 
   one or more wavebands in one or more fibers may be affected, but not 
   the entire fiber or link cable. Existing protection/restoration 
   approaches deal only with failures of individual wavelengths and 
   fiber/link failure. Hence, new approaches and techniques to provide 
   effective protection and restoration based on the concept of waveband 
   are needed, as does the use of waveband conversion and/or wavelength 
   conversion to recover from waveband layer failures.  
    
   For example, in singular OXC networks one cannot merge the traffic 
   carried  by  two  or  more  wavelengths  without  going  through  OEO 
   (Optical-Electrical-Optical) conversions. However, in MG-OXC networks 
   a new recovery technique can merge the critical traffic carried in a 
   waveband affected by a waveband failure with the traffic carried by 
   and unaffected waveband, without having to go through any OEO 
   conversions. If a waveband is failed, instead of having to reroute 
   the failure carried by a waveband using a backup waveband along a 
   disjoint path, one may use waveband label-merge operation, whereby 
 
 
Kim et al              Expires - December 2003                 [Page  6]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   the traffic carried by failed wavelengths in a failed waveband can be 
   restored on the corresponding wavelengths in other active waveband; 
   it may also be implemented by using a novel device operating under a 
   principle similar to that of waveband conversion, which can avoid 
   demultiplexing waveband, as required by wavelength conversion.  
    
   As another example, assume that only one wavelength in a waveband is 
   failed. To recover from such a failure using the spare wavelength in 
   other active waveband, one may convert a failed wavelength in a 
   failed waveband to a spare wavelength in other active waveband at a 
   node  prior  to  the  fault,  this  requires  both  wavebands  to  be 
   demultiplexed at this node. To avoid demultiplexing of the wavebands 
   and preserve the wavelength grouping, waveband label-swap operation, 
   which converts one waveband to other waveband and reversely, can be 
   used to recover from the failure. 
  
   A lightpath can be segmented as many area such as, wavelength, 
   waveband, and fiber path. Each area of optical LSP can have the same 
   or independent local recovery mechanism from other areas that the 
   node adjacent to the failure reroutes the optical LSP around the 
   failure. This can occur a lot faster because no failure notification 
   across the end-to-end networks is necessary. Local recovery mechanism 
   can be chosen according to the recovery of GMPLS [GMPLS-REC]. 
    
 
3. Label Handlings in MG-OXC based GMPLS networks 
  
   In MG-OXC based GMPLS networks, the MG-OXCs are connected to the 
   label switching router(LSR) in overlay model. A label switched path 
   (LSP) is nothing but a lightpath. The label associated with an LSP is 
   the wavelength, waveband, or fiber of corresponding lightpath. The 
   encoding format of these labels (such as, wavelength label, waveband 
   label, and fiber label) is presented in [RFC3471]. The basic label 
   handlings performed by the LSR nodes include add, drop, stack, and 
   swap. Below, the label handlings for MG-OXC based GMPLS networks are 
   presented. 
    
   (1)label-adding and label-dropping 
      The label-adding and label-dropping are done in a similar way as 
      in MPLS networks. These handlings are performed at the edge of 
      MG-OXC nodes for the terminating lightpaths. Wavelength, waveband, 
      fiber label are performed for each lightpath (see Figure 1). 
    
   (2)label-stacking 
      The label-stack can be performed at an ingress node only when the 
      several smaller LSPs can be aggregated to a single, larger LSP. 
      The aggregation is carried out by stacking the labels of smaller 
      LSPs. The larger LSP traverses through the GMPLS network. At the 
      end of the larger LSP, the smaller LSPs are separated by label 
      destacking. This stack operation is similar to multiplexing 
      several virtual connections(VC) into a virtual path(VP) in ATM 

 
 
Kim et al              Expires - December 2003                 [Page  7]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
      networks. The LSPs from the optical networks with singular 
      wavelength OXC cannot be stacked, as an LSP uses the wavelength 
      full. However, multi-granularity lightpaths are performed by 
      optical label-stacking such that fiber label include several 
      waveband label and waveband label is formed by several wavelength 
      label. A lightpath can be segmented as many area such as, 
      wavelength, waveband, and fiber path. So these smaller lightpath 
      can be aggregated to a single, larger lightpath. 
       
   (3) label-swapping 
      At the LSR nodes traversed by an LSP, the labels are swapped. At 
      every node the pair <label_in, port_in> is mapped to <label_out, 
      port_out>. This means that label_in arriving at port_in is 
      replaced by label_out and is sent to port_out. Since the GMPLS 
      network is a circuit-switched network and the messages are 
      optically  switched  in  a  lightpath,  the  label-swapping  is 
      performed only at a node at the time of establishing the LSP. 
      Even then, the labels can be changed at a node only if it has 
      wavelength or waveband conversion capability, otherwise the label 
      remains  unchanged.  It  is  noted  that  label-swapping  can  be 
      performed at the nodes traversed by lightpath during message 
      transfer. 
       
 
4. Signaling extensions for MG-OXC networks 
 
4.1. MG-OXC Parameters 
 
      The traffic parameters for MG-OXC are organized as follows: 
    
       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |  Signal Type  |      CT       |              NC               | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                       Transparency (T)                        | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                           Profile (P)                         | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     
    
      Signal Type (ST): 8 bits 
    
        This field indicates the type of Elementary Signal that 
        comprises the requested LSP. Several transforms can be applied 
        successively on the Elementary Signal to build the Final Signal 
        being actually requested for the LSP. 
 
       Permitted Signal Type values for MG-OXC are: 
        
        

 
 
Kim et al              Expires - December 2003                 [Page  8] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
         Value  Type (MG-OXC input/output transformation) 
          -----  ---------------------------------------- 
           1     wavelength/wavelength 
           2     wavelength/waveband 
           3     waveband/ wavelength 
           4     waveband/ waveband  
           5     waveband/ fiber 
           6     fiber/waveband  
           7     fiber/fiber 
    
    
   Conversion Type (CT):8 bits 
    
        This field indicates the type of Optical Conversion about the 
        Elementary Signal that comprises the requested LSP.  
    
        Permitted Conversion Type values for MG-OXC are: 
    
          Value  Type of Conversion 
          -----  ------------------------ 
              1  wavelength/wavelength  
              2  waveband/ waveband 
        The entire field is set to zero to indicate that no conversion 
        is requested at all (default value). A non-zero field indicates 
        that some conversion is requested. 
    
      Number of Components (NC): 16 bits 
    
        This field indicates the number of signals that are composed 
        from the signal type (wavelength or waveband). 
     
    
      Transparency (T): 32 bits 
    
        This field is a vector of flags that indicates the type of 
        transparency being requested. The default value for this field 
        is zero, i.e. no transparency requested. 
    
        Transparency, as defined from the point of view of this 
        signaling specification, is only applicable to the fields in 
        the Signal Types.  
    
    
        Transparency is not applied at the interfaces with the 
        initiating and terminating LSRs, but is only applied between 
        intermediate LSRs. 
    
        The transparency field is used to request an LSP that supports 
        the requested transparency type; it may also be used to setup 
        the transparency process to be applied at each intermediate 
        LSR. 
    
 
 
Kim et al              Expires - December 2003                 [Page  9] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
          Flag 1 (bit 1): wavelength layer 
          Flag 2 (bit 2): waveband layer 
          Flag 3 (bit 3): fiber layer 
    
    
        Intermediate and egress nodes MUST verify that the node itself 
        and the interfaces on which the LSP will be established can   
        support the requested transparency. If the requested flags can  
        not be supported, the receiver node MUST generate a  
        PathErr/NOTIFICATION message. 
    
    
      Profile (P): 32 bits 
        This field is intended to indicate particular capabilities that 
        must be supported for the LSP, for example monitoring 
        capabilities. 
    
        No standard profile is currently defined and this field SHOULD 
        be set to zero when transmitted and SHOULD be ignored when 
        received. 
    
        In the future TLV based extensions may be created. 
    
  
4.2. RSVP-TE Details 
 
      For RSVP-TE, the MG-OXC traffic parameters are carried in the MG-
      OXC  SENDER_TSPEC  and  FLOWSPEC  objects  (see  [RFC2205]).  The 
      content of the objects is defined above in section 4.1. The 
      objects have the following class and type: 
    
       MG-OXC SENDER_TSPEC object: class = 12, C-Type = TBA (by IANA) 
       MG-OXC FLOWSPEC object: class = 9, C-Type = TBA (by IANA) 
    
    
      For a particular sender in a session the contents of the FLOWSPEC    
      object received in a Resv message SHOULD be identical to the   
      contents of the SENDER_TSPEC object received in the corresponding   
      Path message. If the objects do not match, a ResvErr message with   
      a "Traffic Control Error/Bad Flowspec value" error SHOULD be    
      generated. 
    
      Intermediate and egress nodes MUST verify that the node itself and 
      the interfaces on which the LSP will be established can support 
      the requested Signal Type, CT and NC (as defined in Section 4.1).  
    
      If the requested value(s) can not be supported, the receiver node 
      MUST generate a PathErr message with  a "Traffic Control Error/ 
      Service unsupported" indication (see [RFC2205]). 
    
      Intermediate nodes MUST also verify that the node itself and the 
      interfaces on which the LSP will be established can support the 
 
 
Kim et al              Expires - December 2003                 [Page  10] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
      requested Transparency (as defined in Section 4.1). If the    
      requested value(s) can not be supported, the receiver node MUST 
      generate a PathErr message with a "Traffic Control Error/Service 
      unsupported" indication (see [RFC2205]). 
    
4.3. CR-LDP Details 
 
      For CR-LDP, the MG-OXC traffic parameters are carried in the 
      MG-OXC Traffic Parameters TLV.  The content of the TLV is 
      defined above in Section 2.1. The header of the TLV has the 
      following format: 
    
       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |U|F|          Type             |      Length                   | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    
      The type field for the MG-OXC Traffic Parameters TLV is: TBA 
      (by IANA). 
    
      Intermediate and egress nodes MUST verify that the node itself and 
      the interfaces on which the LSP will be established can support 
      the requested Signal Type, CT and NC (as defined in Section 4.1). 
     
      If the requested value(s) can not be supported, the receiver node 
      MUST  generate  a  NOTIFICATION  message  with  a  "Resource 
      Unavailable" status code (see [RFC3212]). 
    
      Intermediate nodes MUST also verify that the node itself and the 
      interfaces on which the LSP will be established can support the 
      requested  Transparency  (as  defined  in  Section  4.1).  If  the 
      requested value(s) can not be supported, the receiver node MUST 
      generate a NOTIFICATION message with a "Resource Unavailable" 
      status code (see [RFC3212]). 
 
    
5. Operation and Management Considerations 
    
   In considering the Operation and Management of the GMPLS network 
   based on multi-granularity OXC (wavelength, waveband, fiber layer), 
   the  following  requirements  of  each  layer  should  be  considered 
   respectively. 
   
   - information about virtual topology (set of light path connected 
     between MG-OXCs) of each layer 
   - information about link state of each layer 
   - lightpath grouping strategy depending on whether the number of 
     wavebands in a fiber is fixed or variable 
   - information about physical topology (set of fiber connected between 
     MG-OXCs) 

 
 
Kim et al              Expires - December 2003                 [Page  11]
 
draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   - information about the continuity of wavelength or waveband 
     allocated to each link, e.g. wavelength or waveband converter is 
     equipped or not 
   - information about switching capability and port usage (information 
     of capability of fiber, waveband, and wavelength   switching for 
     each port) 
   - information about fiber, the physical link, for example the number 
     of available wavelengths per waveband or fiber, directionality, 
     optical SNR of wavelength, BER 
   - information about the light path, for example, the identity (ID) 
     of the component at the destination network, port ID of adding 
     light  path, port ID of dropping, directionality, Fiber ID, 
     throughput per wavelength and waveband, end-to-end SNR, etc. 
    
    
6. Security Considerations 
    
   This document does not introduce new security issues beyond those 
   inherent in GMPLS. It is, however, possible that using the suggested 
   network  management  attributes  provisioning  can  be  done  as 
   administrative usage. 
    
    
References 
    
   [WAVEBAND]   X. Cao et al.,"Waveband Switching in Optical Networks," 
                IEEE Communications Magazine, April 2003, pp105 - 112. 
   [HCROSS]     M. Lee et al.,"Design of Hierarchical Crossconnect WDM 
                Networks Employing A Two-Stage Multiplexing Scheme of 
                Waveband and Wavelength,∆∆ IEEE JSAC, vol. 20, no. 1 
                January 2002, pp 166-71. 
   [GMPLS-ARCH] Mannie, E.,"Generalized Multi-Protocol Label Switching 
                Architecture", Internet Draft, Work in progress, draft-
                ietf-ccamp-gmpls-architecture-07.txt, May 2003. 
   [LMP]        Lang, J., "Link Management Protocol (LMP)", Internet 
                Draft, Work in progress, draft-ietf-ccamp-lmp-09.txt, 
                June 2003. 
   [GMPLS-REC]  Eric Mannie,D. Papadimitriou "Recovery (Protection  and 
                Restotation) Terminology for GMPLS", IETF Draft, Work 
                in progress,    draft-ietf-ccamp-gmpls-recovery-
                terminology-02.txt,May 2003. 
   [RFC2026]    S. Bradner, "The Internet Standards Process -- Revision 
                3", RFC 2026, October 1996. 
   [RFC2119]    Brander, s., " Key words for use in RFCs to Indicate 
                Requirement Levels", BCP 14, RFC 2119, March 1997. 
   [RFC2205]    Braden, R., et al., "Resource ReSerVation Protocol            
                (RSVP) -- Version 1 Functional Specification", RFC              
                2205, September 1997. 
   [RFC3212]    Jamoussi, B., et al., "Constraint-Based LSP Setup using         
                LDP", RFC 3212, January 2002. 


 
 
Kim et al              Expires - December 2003                 [Page  12] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
   [RFC3386]    W. Lai, D. McDysan,"Network Hierarchy and Multilayer 
                Survivability," IETF RFC 3386, November 2002.  
   [RFC3471]    L. Berger (Editor),"Generalized Multi-Protocol Label 
                Switching (GMPLS) Signaling Functional Description", 
                IETF RFC 3471, January 2003. 
    
Author's Addresses 
    
   Dae-Gun Kim 
   KT(Korea Telecom) and Korea University 
   206 Jungja-dong,Bundang-gu, Sungnam-City, Kyonggi-do,463-711, Korea 
   Phone : 82-2-929-5625 
   e-mail : dkim@kt.co.kr 
    
   Gyu Myoung Lee 
   Information and Communication University (ICU) 
   58-4, Hwaam-dong, Yuseong-gu, Daejeon, 305-732, Korea  
   Phone: 042-866-6122 
   e-mail : gmlee@icu.ac.kr 
    
   Jun Kyun Choi 
   Information and Communication University (ICU) 
   58-4, Hwaam-dong, Yuseong-gu, Daejeon, 305-732, Korea  
   Phone: 042-866-6122 
   e-mail : jkchoi@icu.ac.kr 
    
   SungChang Lee 
   Hankuk Aviation University 
   200-1, Hwajon-dong, Koyang-city, Kyonggi-do, 412-791,Korea 
   Phone: 02-300-0127  
   e-mail: sclee@mail.hangkong.ac.kr 
    
   Jin Woo Park 
   Korea University 
   1,5-ka, Anam-dong, Sungbuk-ku, Seoul, 136-701, Korea  
   Phone: 82-2-3290-3225 
   e-mail: jwpark@korea.ac.kr 
    
   Chul-Hee Kang 
   Korea University 
   1,5-ka, Anam-dong, Sungbuk-ku, Seoul, 136-701, Korea  
   Phone: 82-2-927-6116 
   e-mail: chkang@widecomm.korea.ac.kr  
   





 
 
Kim et al              Expires - December 2003                 [Page  13] 

draft-kim-ccamp-gmpls-mgoxc-00.txt                             June 2003 
 
 
Full Copyright Statement 
 
  "Copyright (C) The Internet Society 2003. All Rights Reserved". This 
  document and translations of it may be copied and furnished to others, 
  and derivative works that comment on or otherwise explain it or 
  assist in its implementation may be prepared, copied, published and 
  distributed, in whole or in part, without restriction of any kind, 
  provided that the above copyright notice and this paragraph are 
  included on all such copies and derivative works. However, this 
  document itself may not be modified in any way, such as by removing 
  the copyright notice or references to the Internet Society or other 
  Internet organizations, except as needed for the purpose of 
  developing Internet standards in which case the procedures for 
  copyrights defined in the Internet Standards process must be followed, 
  or as required to translate it into  
   
   
  Document: draft-kim-gmpls-mgoxc-00.txt 
   
  Expiration Date: December 2003 
 



























 
 
Kim et al              Expires - December 2003                 [Page  14] 

